IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28002x_dcsm_bank0_z2_otp_regs.xml
<module id="DCSM_BANK0_Z2_OTP" HW_revision="" description="DCSM BANK0 Z2 OTP Registers">
	<register id="B0_Z2OTP_LINKPOINTER1" width="32" page="1" offset="0x0" internal="0" description="Zone 2Link Pointer1 in Z2 OTP for flash BANK0">
		<bitfield id="B0_Z2OTP_LINKPOINTER1" description="Zone2 Link Pointer 1 location in USER OTP of Flash BANK0." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="B0_Z2OTP_LINKPOINTER2" width="32" page="1" offset="0x4" internal="0" description="Zone 2 Link Pointer2 in Z2 OTP for flash BANK0">
		<bitfield id="B0_Z2OTP_LINKPOINTER2" description="Zone2 Link Pointer 2 location in USER OTP of Flash BANK0." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="B0_Z2OTP_LINKPOINTER3" width="32" page="1" offset="0x8" internal="0" description="Zone 12Link Pointer3 in Z2 OTP for flash BANK0">
		<bitfield id="B0_Z2OTP_LINKPOINTER3" description="Zone2 Link Pointer 3 location in USER OTP of Flash BANK0." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2OTP_BOOTPIN_CONFIG" width="32" page="1" offset="0xc" internal="0" description="Boot Pin Configuration">
		<bitfield id="Z2OTP_BOOTPIN_CONFIG" description="Zone2 Boot pin config register location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2OTP_GPREG2" width="32" page="1" offset="0xe" internal="0" description="Zone-2 General Purpose Register-2 content">
		<bitfield id="Z2OTP_GPREG2" description="Zone2 General Purpose register location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2OTP_PSWDLOCK" width="32" page="1" offset="0x10" internal="0" description="Secure Password Lock in Z2 OTP">
		<bitfield id="Z2OTP_PSWDLOCK" description="Zone2 Password lock location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2OTP_CRCLOCK" width="32" page="1" offset="0x14" internal="0" description="Secure CRC Lock in Z2 OTP">
		<bitfield id="Z2OTP_CRCLOCK" description="Zone2 CRC lock location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2OTP_BOOTDEF_LOW" width="32" page="1" offset="0x1c" internal="0" description="Boot definition (low 32bit)">
		<bitfield id="Z2OTP_BOOTDEF_LOW" description="Zone2 Boot definition register location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2OTP_BOOTDEF_HIGH" width="32" page="1" offset="0x1e" internal="0" description="Boot definition (high 32bit)">
		<bitfield id="Z2OTP_BOOTDEF_LOW" description="Zone2 Boot definition location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
